{
  "summaries": [
    {
      "slug": "k-array-gdm",
      "category": "Event",
      "title": "K-array GDM 2024",
      "shortDescription": "K‑array’s GDM (General Distributor Meeting) is an exclusive annual event held at the K-array’s headquarters in the scenic Tuscan village of Scarperia e San Piero, Italy. Distributors and partners from around the world come together to discover the latest innovations, experience new products, and learn about K‑array’s advanced audio solutions.",
      "location": "Scarperia e San Piero, Florence, Italy",
      "dateLabel": "13-15 Oct 2024",
      "narrative": "At K-array headquarters we joined distributors from across 43 countries, sharing new product insights and architectural integration training ahead of the 2025 roadmap.",
      "heroMedia": {
        "kind": "image",
        "src": "K-array GDM_event2_image.jpg",
        "alt": "Delegates at the K-array Global Distributor Meeting"
      },
      "gallery": [
        "K-array GDM_event2_image.jpg",
        "K-array GDM_event2_2image.jpg",
        "K-array GDM_event2_3image.jpg"
      ],
      "highlights": [
        "Hands-on labs with Anakonda, Thunder, and Pinnacle systems",
        "Strategic sessions aligning global partners on innovation"
      ]
    },
    {
      "slug": "suara-festival",
      "category": "Event",
      "title": "Suara Festival Bali",
      "shortDescription": "We are proud to have been invited to the Suara Festival 2024 in Bali, Indonesia—an international celebration of music, arts, and culture. Set against the stunning seaside cliffs of Nyanyi Beach, the festival featured 7 stages showcasing the best of international, regional, and local music talent, thought-provoking talks, immersive art installations, culinary experiences, wellness activities, and traditional Balinese performances.",
      "location": "Nyanyi Beach, Bali, Indonesia",
      "dateLabel": "2024 Edition",
      "narrative": "Suara welcomed more than nine thousand guests from sixty countries, intertwining music, thought leadership, art, culinary, and wellness programming along the cliffs of Nyanyi beach.",
      "heroMedia": {
        "kind": "video",
        "src": "event_title_video.mp4",
        "poster": "Suara_Festival_Bali_1.jpg"
      },
      "gallery": [
        "Suara_Festival_Bali_1.jpg",
        "Suara_Festival_Bali_2.jpg",
        "Suara_Festival_Bali_3.jpg"
      ],
      "highlights": [
        "Seven immersive stages across the Balinese coastline",
        "Flexible Anakonda arrays delivering powerful yet discreet sound"
      ]
    },
    {
      "slug": "reka-rix",
      "category": "Event",
      "title": "REKA Interiors Exhibition - RiX 2024 ",
      "shortDescription": "Nextrend Systems was honored to design the Total Sound Solution for the CURIOS Pavilion and to present a talk at RiX on “Design Senses – Sound”. For this event, K-array speakers were selected as the premier audio solution, chosen specifically to complement the pavilion’s refined design. The Anakonda flexible line array was installed along the walkway, delivering a seamless and immersive auditory experience that harmonized perfectly with the elegant architecture.",
      "location": "KL Convention Centre, Kuala Lumpur | Malaysia",
      "dateLabel": "October 31 - November 3, 2024",
      "narrative": "RiX gathered Malaysia's interior design community for showcases, forums, and installations; we delivered the total sound solution for the CURIOS Pavilion and SoundPod rooms.",
      "heroMedia": {
        "kind": "image",
        "src": "REKA Interiors Exhibition – RiX_event3_image.jpg",
        "alt": "CURIOS Pavilion at REKA Interiors Exhibition"
      },
      "gallery": [
        "REKA Interiors Exhibition – RiX_event3_image.jpg",
        "REKA Interiors Exhibition – RiX_event3_image2.jpg",
        "REKA Interiors Exhibition – RiX_event3_image3.jpg"
      ],
      "highlights": [
        "Anakonda-lined walkways delivering immersive ambience",
        "SoundPod micro-theatre driven by K-array Lyzard KZ14"
      ]
    },
    {
      "slug": "crossover-asics",
      "category": "Event",
      "title": "Crossover - ASICS GEL-NIMBUS 10.1 Launch",
      "shortDescription": "Nextrend Systems was invited to provide the sound solution for the Crossover Asics Nimbus 10.1 launch event, designing a system that merges seamlessly with the immersive sound lab created by Kaito. The goal was to deliver a cohesive auditory experience that complements the interactive and experimental theme of the event.",
      "location": "Crossover, The Exchange TRX, Malaysia",
      "dateLabel": "4 Oct 2024",
      "narrative": "Projection mapping, a reactive sound lab, and a sensor-driven sneaker installation introduced the Gel-Nimbus 10.1 collaboration at Crossover's concept flagship.",
      "heroMedia": {
        "kind": "image",
        "src": "Crossover Asics Gel-Nimbus 10.1 Launch Event_event4_image1.jpg",
        "alt": "Crossover Asics Gel-Nimbus 10.1 launch sound lab"
      },
      "gallery": [
        "Crossover Asics Gel-Nimbus 10.1 Launch Event_event4_image1.jpg",
        "Crossover Asics Gel-Nimbus 10.1 Launch Event4_image2.jpg",
        "Crossover Asics Gel-Nimbus 10.1 Launch Event4_image3.jpg"
      ],
      "highlights": [
        "Amina Invisible Speakers showcased as sculptural elements",
        "Sensor-enabled sneakers triggering responsive sound cues"
      ]
    },
    {
      "slug": "brionvega-find",
      "category": "Design Fair",
      "title": "FIND - Design Fair Asia 2024",
      "shortDescription": "We recently showcased Brionvega’s iconic designs at FIND Design Fair Asia, held in Singapore from 26–28 September 2024. As a premier trade show for furniture, interiors, and contemporary design, FIND Design Fair Asia provided the perfect platform to present Brionvega’s rich legacy—spanning over 60 years of Italian design excellence—and its collaboration with some of the most influential designers of the 20th century.",
      "location": "Sands Expo & Convention Centre, Marina Bay Sands | Singapore",
      "dateLabel": "September 26-28, 2024",
      "narrative": "Designers, collectors, and partners explored Brionvega's modern classics - merging Italian craftsmanship with premium audio at FIND Design Fair Asia.",
      "heroMedia": {
        "kind": "image",
        "src": "Brionvega at FIND Design Fair Asia 2024 in Singapore_event_image1.jpg",
        "alt": "Brionvega showcase at FIND Design Fair Asia"
      },
      "gallery": [
        "Brionvega at FIND Design Fair Asia 2024 in Singapore_event_image1.jpg",
        "Brionvega at FIND Design Fair Asia 2024 in Singapore_event5_image.jpg",
        "Brionvega at FIND Design Fair Asia 2024 in Singapore_event5_image2.jpg"
      ],
      "highlights": [
        "Radiocubo, Totem RR231, and Radiofonografo centrepieces",
        "Curated storytelling on six decades of Italian industrial design"
      ]
    },
    {
      "slug": "forest-furniture-roche-bobois",
      "category": "Event",
      "title": "Forest Furniture - Roche Bobois Grand Opening",
      "shortDescription": "For this project, our primary goal was to deliver a seamless and immersive audio experience throughout the venue. The food corner and entrance areas were covered using KGEAR GP8 speakers, providing clear and balanced sound while maintaining the premium ambiance of the space.",
      "location": "Forest Furniture, Bangsar, Malaysia",
      "dateLabel": "17 Jul 2024",
      "narrative": "Forest Furniture's launch paired couture furnishings with a precision-tuned audio journey, reinforcing the brand's reputation for world-class service.",
      "heroMedia": {
        "kind": "image",
        "src": "Forest Furniture Roche Bobois Launching Event6_image1.jpg",
        "alt": "Forest Furniture Roche Bobois launch event"
      },
      "gallery": [
        "Forest Furniture Roche Bobois Launching Event6_image1.jpg",
        "Forest Furniture Roche Bobois Launching Event6_image2.jpg",
        "Forest Furniture Roche Bobois Launching Event6_image3.jpg"
      ],
      "highlights": [
        "Multi-zone coverage with K-array Vyper and Anakonda arrays",
        "Brionvega centrepieces complementing couture furnishings"
      ]
    },
    {
      "slug": "robb-report-aham",
      "category": "Event",
      "title": "Robb Report x AHAM Capital",
      "shortDescription": "We were honoured to be part of House of Robb, introduced by Robb Report Malaysia in conjunction with AHAM Capital’s Generational Wealth Summit, held at a four-bedroom duplex villa at Anantara Desaru Coast Residences. For this exclusive event, we designed and delivered the complete sound experience, ensuring the audio system enhanced the atmosphere without compromising the refined aesthetics of the space.",
      "location": "Anantara Desaru Coast Resort & Villas, Johor | Malaysia",
      "dateLabel": "November 8, 2024",
      "narrative": "Robb Report Malaysia and AHAM Capital hosted high-net-worth guests for a seaside evening where curated listening lounges and tastings unfolded in sync.",
      "heroMedia": {
        "kind": "image",
        "src": "Robb Report x AHAM Capital_event_10image.jpg",
        "alt": "Robb Report x AHAM Capital private salon"
      },
      "gallery": [
        "Robb Report x AHAM Capital_event_1image.jpg",
        "Robb Report x AHAM Capital_event_2image.jpg",
        "Robb Report x AHAM Capital_event_3image.jpg"
      ],
      "highlights": [
        "Linked terraces and lounges tuned as one atmosphere",
        "Discreet K-array arrays matching the resort's tranquil design"
      ]
    },
    {
      "slug": "brionvega-iconic-collection",
      "category": "Event",
      "title": "Brionvega Iconic Audio Collection",
      "shortDescription": "Brionvega is an Italian manufacturer of iconic objects, established in 1960. As an icon of Italian design, Brionvega collaborates with notable architects and industrial designers. Brionvega’s mission is to revamp made in Italy design icons worldwide through the objects that made the history of Italian industrial design.",
      "location": "Asia Pacific Roadshow",
      "dateLabel": "2024 Series",
      "narrative": "Collectors experienced the craftsmanship behind Brionvega's design icons, each presented as functional sculpture marrying form and sound.",
      "heroMedia": {
        "kind": "image",
        "src": "Brionvega, Iconic Italian Design Sound Technologyevent7_image1.jpg",
        "alt": "Brionvega iconic design showcase"
      },
      "gallery": [
        "Brionvega, Iconic Italian Design Sound Technologyevent7_image1.jpg",
        "Brionvega, Iconic Italian Design Sound Technologyevent7_image3.jpg",
        "Brionvega, Iconic Italian Design Sound Technology_event7_image4.jpg"
      ],
      "highlights": [
        "Radiofonografo RR226, Radiocubo 50, and Totem RR231 centrepieces",
        "Design storytelling on more than six decades of Italian heritage"
      ]
    }
  ],
  "details": {
    "k-array-gdm": {
      "slug": "k-array-gdm",
      "category": "Event",
      "title": "K-array GDM 2024",
      "location": "Scarperia e San Piero, Tuscany | Italy",
      "dateRange": "October 13-15, 2024",
      "profile": [
        "K-ARRAY Audio Solutions is globally renowned as one of the most innovative high-technology professional speaker manufacturers in the world founded in Italy. Since the formation of HP Sound Equipment in 1990 and K-ARRAY in 2005,the brand has been pioneering and innovating new audio solutions for live entertainment and the most demanding architectural designs."
      ],
      "additionalNotes": [
        "K‑array’s GDM (General Distributor Meeting) is an exclusive annual event held at the K-array’s headquarters in the scenic Tuscan village of Scarperia e San Piero, Italy. Distributors and partners from around the world come together to discover the latest innovations, experience new products, and learn about K‑array’s advanced audio solutions."
      ],
      "eventNarrative": [
        "The event features interactive product demonstrations and networking opportunities, giving distributors the chance to connect, learn, and share insights with industry peers. We had the opportunity to explore the latest and upcoming K‑array products and bring these innovations directly to our partners in Malaysia, ensuring they can offer cutting-edge audio solutions and an enhanced experience to their clients.",
        "More than a meeting, K‑array GDM is a celebration of innovation, collaboration, and the shared passion for delivering exceptional audio experiences worldwide."
      ],
      "gallery": [
        "K-array GDM_event2_4image.jpg",
        "K-array GDM_event2_6image.jpg",
        "K-array GDM_event2_image.jpg",
        "K-array GDM_event2_2image.jpg",
        "K-array GDM_event2_3image.jpg",
        "K-array GDM_event2_5image.jpg",
        "K-array GDM_event2_7image.jpg"
      ],
      "heroMedia": {
        "kind": "image",
        "src": "K-array GDM_event2_image.jpg",
        "alt": "Delegates overlooking the Tuscan hills during the K-array summit"
      }
    },
    "suara-festival": {
      "slug": "suara-festival",
      "category": "Event",
      "title": "K‑array Training & Suara Festival Bali 2024",
      "location": "Nuanu Creative City, Bali | Indonesia",
      "dateRange": "July 26–28, 2024",
      "overview": "During our K‑array training in Bali, we gained in-depth product and software knowledge, learning how to maximize the performance of K‑array systems. We also visited a live installation at the Suara Festival, where K‑array speakers were used throughout the event. Seeing the system in action, we learned how and why the speakers were strategically placed, gaining practical insights into real-world applications and optimal sound delivery in diverse environments.",
      "profile": [
      "The Suara Music and Arts Festival returns from July 26–28, 2024 at Nuanu, marking the official opening of the Creative City. Celebrated for its innovative programming and vibrant cultural experience, the festival brings together music, art, and community, offering a platform for both international and regional talent.",
      
      "K-ARRAY Audio Solutions is globally renowned as one of the most innovative high-technology professional speaker manufacturers in the world founded in Italy. Since the formation of HP Sound Equipment in 1990 and K-ARRAY in 2005, the brand has been pioneering and innovating new audio solutions for live entertainment and the most demanding architectural designs."
    ],
      "additionalNotes": [
        "We are proud to have been invited to the Suara Festival 2024 in Bali, Indonesia—an international celebration of music, arts, and culture. Set against the stunning seaside cliffs of Nyanyi Beach, the festival featured 7 stages showcasing the best of international, regional, and local music talent, thought-provoking talks, immersive art installations, culinary experiences, wellness activities, and traditional Balinese performances."
      ],
      "eventNarrative": [
        "This year marked the third edition of Suara Festival, welcoming over 9,000 fans from more than 60 countries over three days. The festival attracted a vibrant mix of Bali locals and visitors, creating a truly global cultural experience. As Suara Co-Founder, CEO, Jason Swamy said, “Partnering with Sergey Solonin to bring Suara to Nuanu is a dream come true. Nuanu’s visionary approach and stunning venues provide the perfect setting for an inclusive, cross-cultural festival experience that Bali has never seen before.”",
        "K-array loudspeakers played a vital role in delivering exceptional sound throughout the festival. Their high-performance, flexible, and discreet design ensured consistent audio quality across all stages and event areas. Suara Producer Alexander Solonin and Sound Engineer Semen Chumanikhin shared, “We had heard the power of K-array’s flexible Anakonda line array system and Thunder-KS2 subwoofer at Nuanu recording studio, which sounded truly amazing.” This instilled strong confidence in the K-array loudspeakers used throughout the event."
      ],
      "gallery": [
        "Suara_Festival_Bali_1.jpg",
        "Suara_Festival_Bali_6.jpg",
        "Suara_Festival_Bali_7.jpg",
        "Suara_Festival_Bali_2.jpg",
        "Suara_Festival_Bali_3.jpg",
        "Suara_Festival_Bali_4.jpg",
        "Suara_Festival_Bali_5.jpg"
      ],
      "heroMedia": {
        "kind": "video",
        "src": "event_title_video.mp4",
        "poster": "Suara_Festival_Bali_5.jpg"
      }
    },
    "reka-rix": {
      "slug": "reka-rix",
      "category": "Event",
      "title": "REKA Interiors Exhibition - RiX 2024",
      "location": "KL Convention Centre, Kuala Lumpur | Malaysia",
      "dateRange": "31 - November 3, 2024",
      "overview": "RiX is presented by C.I.S under REKA Design Week as the annual gathering for Malaysia's interior design community, curated by the Malaysian Institute of Interior Designers.",
      "profile": [
        "RiX is a platform presented by C.I.S as an official event held under the REKA Design Week, which is the annual event for the interior designers’ community by the Malaysian Institute of Interior Designers (MIID).",
        "Committed to showcasing only the very best of each exhibitor’s collections and products, RiX taps into Malaysia’s interior design industry – Offering a truly outstanding experience in a typically crowded marketplace with power-packed programmes and activities such as conference and forums, industry talks and updates, discussions, networking and workshops for the design fraternity."
      ],
      "additionalNotes": [
        "Nextrend Systems was honored to design the Total Sound Solution for the CURIOS Pavilion and to present a talk at RiX on “Design Senses – Sound”. For this event, K-array speakers were selected as the premier audio solution, chosen specifically to complement the pavilion’s refined design. The Anakonda flexible line array was installed along the walkway, delivering a seamless and immersive auditory experience that harmonized perfectly with the elegant architecture."
      ],
      "eventNarrative": [
        "To enhance the visual and experiential impact, we presented the iconic Brionvega Radiofonografo RR226 and Totem RR231, both celebrated pieces in the MoMA collection. These legendary designs, with over 50 years of history, blend visionary aesthetics with exceptional sound quality, elevating the pavilion experience for all visitors.",
        "Inside the SoundPod Room, we curated a fully immersive audio environment. Compact yet powerful K-array Lyzard KZ14 speakers were placed strategically in each of the four corners, creating a dynamic and enveloping soundscape that captivates visitors and draws them into the pure elegance of sound.",
        "For more subtle areas, K-array Vyper KV102 speakers were installed in two corners, offering discreet yet powerful audio without impacting the aesthetic. The understated design ensures the auditory experience complements the pavilion’s ambiance, allowing guests to enjoy sound and space in perfect harmony.",
        "For talks and stage performances, the K-array Pinnacle KR402 was deployed, providing crystal-clear, high-performance sound that elevates live presentations. The system delivers precise audio, supporting both the energy and sophistication of the stage while maintaining the overall elegance of the pavilion experience."
      ],
      "keyProducts": [
        "K-array Lyzard-KZ14 x4",
        "K-array Anakonda-KAN200+8 x2",
        "K-array Vyper-KV102 x2",
        "K-array Pinnacle-KR402 x2",
        "K-array Truffle-KTR25 x1",
        "K-array Rumble-KU210 x2",
        "K-array Kommander-KA28 x1",
        "Brionvega Radiofonografo-RR126 x1",
        "Brionvega Totem-RR231 x1",
        "Midas MR18",
        "Frog-is Fi-WP2V",
        "Shure Mic"
      ],
      "videos": [
        {
          "title": "RiX CURIOS Pavilion walkthrough",
          "url": "https://youtube.com/shorts/BXDaLOBlsqY?si=9z-tN_WngAr9br5A"
        },
        {
          "title": "RiX SoundPod immersion",
          "url": "https://youtube.com/shorts/ZTZeLTZOG7c?si=NYJecN5JTyiLdHsW"
        }
      ],
      "gallery": [
        "REKA Interiors Exhibition – RiX_event3_image.jpg",
        "REKA Interiors Exhibition – RiX_event3_image4.jpg",
        "REKA Interiors Exhibition – RiX_event3_image3.jpg",
        "REKA Interiors Exhibition – RiX_event3_image4.jpg",
        "REKA Interiors Exhibition – RiX_event3_image5.jpg",
        "REKA Interiors Exhibition – RiX_event3_image7.jpg",
        "REKA Interiors Exhibition – RiX_event3_image8.jpg",
        "REKA Interiors Exhibition – RiX_event3_image9.jpg",
        "REKA Interiors Exhibition – RiX_event3_image10.jpg",
        "REKA Interiors Exhibition – RiX_event3_image11.jpg",
        "REKA Interiors Exhibition – RiX_event3_image12.jpg"

      ],
      "heroMedia": {
        "kind": "image",
        "src": "REKA Interiors Exhibition – RiX_event3_image.jpg",
        "alt": "Design Senses pavilion at RiX"
      }
    },
    "crossover-asics": {
      "slug": "crossover-asics",
      "category": "Event",
      "title": "Crossover - ASICS GEL-NIMBUS 10.1 Launch",
      "location": "TRX, Kuala Lumpur | Malaysia",
      "dateRange": "October 4, 2024",
      "overview": "By combining Amina Invisible Speakers with Kaito’s creative installations and interactive technology, we delivered a bespoke, immersive, and visually striking audio experience. The project demonstrated how carefully designed sound solutions can enhance innovation, interaction, and visitor engagement in experiential events.",
      "profile": [
        "CROSSOVER is a multi-label retail space and concept flagship store. With installation-like spaces and special pop-ups, CROSSOVER houses top Japanese and European labels and more, including Carhartt WIP, Aries and Patta."
      ],
      "role": [
        "Nextrend Systems was invited to provide the sound solution for the Crossover Asics Nimbus 10.1 launch event, designing a system that merges seamlessly with the immersive sound lab created by Kaito. The goal was to deliver a cohesive auditory experience that complements the interactive and experimental theme of the event."
      ],
      "eventNarrative": [
        "For this installation, the Amina Invisible Speaker was chosen as the primary audio solution. Rather than concealing the speaker, we showcased its raw design, aligning perfectly with the irregular and industrial aesthetic of Kaito’s sound lab. The speakers provided clear, balanced, and immersive sound while reinforcing the creative theme of the space.",
        "The combination of Kaito’s Liquid Mirror sound installation and the Amina Invisible Speaker elevated the sound lab experience to a whole new level. Visitors were immersed in a dynamic auditory environment that responded intuitively to movement and space, creating a truly interactive sound experience.",
        "A standout feature of the experience was a custom sensor embedded inside the shoes, allowing the sound to shift in sync with movement and touch. This integration of motion-responsive audio added a layer of interactivity, fully engaging visitors and creating a unique, immersive connection between the physical environment and the sound system."
      ],
      
      "keyProducts": [
        " Amina Invisible speaker x5",
        "Frog-Is FI-SUB6P x1",
        "Frog-Is FI-Amp4D x2"
      ],
      "gallery": [
        "Crossover Asics Gel-Nimbus 10.1 Launch Event_event4_image1.jpg",
        "Crossover Asics Gel-Nimbus 10.1 Launch Event_event4_image7.jpg",
        "Crossover Asics Gel-Nimbus 10.1 Launch Event_event4_image8.jpg",
        "Crossover Asics Gel-Nimbus 10.1 Launch Event4_image2.jpg",
        "Crossover Asics Gel-Nimbus 10.1 Launch Event4_image3.jpg",
        "Crossover Asics Gel-Nimbus 10.1 Launch Event4_image5.jpg"
      ],
      "heroMedia": {
        "kind": "image",
        "src": "Crossover Asics Gel-Nimbus 10.1 Launch Event_event4_image6.jpg",
        "alt": "Sensor-driven sound lab at Crossover TRX"
      }
    },
    "brionvega-find": {
      "slug": "brionvega-find",
      "category": "Event",
      "title": "FIND - Design Fair Asia 2024",
      "location": "Marina Bay Sands, Singapore",
      "dateRange": "26-28 September 2024",
      "overview": "We showcased Brionvega's iconic products at FIND Design Fair Asia, the region's premier trade show presenting curated furniture, interiors, and design brands.",
      "profile": [
        "FIND – Design Fair Asia 2024 present the latest in contemporary design to the region, showcasing innovative and inspiring products, solutions, content, and features while acting as the definitive link for suppliers of furniture, lighting, kitchen, bathroom, and homeware to the lucrative Asian market."
      ],
      "role": [
        "We recently showcased Brionvega’s iconic designs at FIND Design Fair Asia, held in Singapore from 26–28 September 2024. As a premier trade show for furniture, interiors, and contemporary design, FIND Design Fair Asia provided the perfect platform to present Brionvega’s rich legacy—spanning over 60 years of Italian design excellence—and its collaboration with some of the most influential designers of the 20th century."
      ],
      "eventNarrative": [
        "Throughout the exhibition, we welcomed many guests eager to experience Brionvega’s timeless creations up close. Visitors were drawn to the brand’s exceptional craftsmanship, sculptural forms, and refined detailing, discovering how Brionvega seamlessly blends industrial design with musical heritage. From radios to stereo systems and collectible audio objects, each piece reflected a commitment to premium quality and enduring design.",
        "Highlights included the vibrant Radio Cubo 50° by Marco Zanuso and Richard Sapper, the sculptural Totem RR231 by Mario Bellini, and the iconic Radiofonografo RR226 by the Castiglioni brothers. These legendary designs continue to stand as cultural icons—celebrated for their bold aesthetics, functional innovation, and timeless appeal.",
        "The exhibition sparked engaging conversations, with visitors keen to learn more about the stories, design philosophies, and cultural significance behind each Brionvega creation. We look forward to continuing this journey—sharing iconic designs that marry form, function, and timeless elegance, while inspiring new generations through meaningful and enduring design."
      ],
      "gallery": [
        "Brionvega at FIND Design Fair Asia 2024 in Singapore_event_image6.jpg",
        "Brionvega at FIND Design Fair Asia 2024 in Singapore_event5_image5.jpg",
        "Brionvega at FIND Design Fair Asia 2024 in Singapore_event_image1.jpg",
        "Brionvega at FIND Design Fair Asia 2024 in Singapore_event5_image.jpg",
        "Brionvega at FIND Design Fair Asia 2024 in Singapore_event5_image2.jpg",
        "Brionvega at FIND Design Fair Asia 2024 in Singapore_event5_image4.jpg"
      ],
      "heroMedia": {
        "kind": "image",
        "src": "Brionvega at FIND Design Fair Asia 2024 in Singapore_event_image1.jpg",
        "alt": "Brionvega lounge at FIND Design Fair Asia"
      }
    },
    "forest-furniture-roche-bobois": {
      "slug": "forest-furniture-roche-bobois",
      "category": "Event",
      "title": "Forest Furniture - Roche Bobois Grand Opening",
      "location": "Jalan Maarof, Bangsar | Malaysia",
      "dateRange": "July 17, 2024",
      "overview": "Forest Furniture's launch underscored its commitment to world-class service, presenting couture furnishings alongside an immersive audio journey.",
      "profile": [
        "Forest Furniture Malaysia is a premier luxury furniture retailer known for curating high-end European designs, particularly from Italian heritage brands. With over a decade of experience, the brand emphasizes prestige as a lifestyle, offering meticulously crafted pieces that blend classic traditions with contemporary innovation.",
        "Roche Bobois is a world leader in high-end furniture design and distribution, known for embodying the French Art de Vivre. The company operates internationally and is a French family business that was founded in the 1960s."
      ],
      "role": [
        "For this project, our primary goal was to deliver a seamless and immersive audio experience throughout the venue. The food corner and entrance areas were covered using KGEAR GP8 speakers, providing clear and balanced sound while maintaining the premium ambiance of the space."
      ],
      "eventNarrative": [
        "Inside the showroom, we deployed K-array Vyper speakers in all corners, ensuring full coverage and immersive audio for the entire space. Every detail of the sound experience was carefully calibrated to complement the showroom’s layout and aesthetic, creating a cohesive auditory environment.",
        "A green grass wall inside the showroom was enhanced with K-array Anakonda speakers, providing subtle yet powerful audio that integrated seamlessly with the design. At the center of the showroom, the Brionvega Radiofonografo served as the vinyl player, sending music through the entire speaker system and combining iconic design with exceptional sound performance.",
        "By strategically combining KGEAR, K-array, and Brionvega, we created a harmonious blend of design and sound, ensuring every corner of the venue delivered an immersive and aesthetically pleasing audio experience for all visitors."
      ],
      "keyProducts": [
        "- K-array Vyper-KV102 x 2",
        "K-array Vyper-KV52 x 2",
        "K-array Anakonda-KAN200+8 x 2",
        "K-array Thunder-KS1P x 1",
        "K-array Rumble-KU210 x 1",
        "K-array Rumble-KU212 x 1",
        "K-array Kommander-KA34 x 1",
        "K-array Kommander-KA104x 1",
        "Frog-Is FI-Mix8 x 1",
        "Frog-Is FI-WP2V Wireless Mics x 2",
        "Brionvega Radiofonografo-RR226 fo-st x 1"
      ],
      "gallery": [
        "Forest Furniture Roche Bobois Launching Event6_image4.png",
        "Forest Furniture Roche Bobois Launching Event6_image5.png",
        "Forest Furniture Roche Bobois Launching Event6_image3.jpg",
        "Forest Furniture Roche Bobois Launching Event6_image1.jpg",
        "Forest Furniture Roche Bobois Launching Event6_image2.jpg"
      ],
      "heroMedia": {
        "kind": "image",
        "src": "Forest Furniture Roche Bobois Launching Event6_image1.jpg",
        "alt": "Forest Furniture Roche Bobois showcase"
      }
    },
    "robb-report-aham": {
      "slug": "robb-report-aham",
      "category": "Event",
      "title": "House of Robb x AHAM Capital",
      "location": "Anantara Desaru Coast Resort & Villas, Johor | Malaysia",
      "dateRange": "November 8, 2024",
      "overview": "This project showcased how thoughtful speaker selection and precise placement can deliver an immersive sound experience while maintaining architectural harmony. By combining K-array’s discreet performance with Brionvega’s iconic design, we created a soundscape that complemented the luxury setting and elevated the overall event experience.",
      "profile": [
        "Robb Report Malaysia is the industry’s leading luxury lifestyle publication. An indispensable and intelligent resource, Robb Report connect with HNWIs with experiences and accoutrements to cultivate and elevate their appreciation of the finest things in life.",
        "AHAM Asset Management Berhad (“AHAM Capital”) is an independently-managed, institutionally-owned asset management ﬁrm. Since its formation in 2001, AHAM Capital has served the wealth needs of corporates, institutions, pension funds, government-linked companies, high net worth individuals and the mass affluent."
      ],
      "additionalNotes": [
        "We were honoured to be part of House of Robb, introduced by Robb Report Malaysia in conjunction with AHAM Capital’s Generational Wealth Summit, held at a four-bedroom duplex villa at Anantara Desaru Coast Residences. For this exclusive event, we designed and delivered the complete sound experience, ensuring the audio system enhanced the atmosphere without compromising the refined aesthetics of the space."
      ],
      "eventNarrative": [
        "Inside the residence, we integrated K-array Vyper ultra-slim speakers, featuring a discreet 1-inch profile, throughout the event areas. Their minimal form allowed the speakers to blend seamlessly into the architecture, preserving the visual elegance while delivering clear and balanced sound for conversations, background music, and live moments within the space.",
        "For the outdoor and poolside areas, K-array Pinnacle KR402 speakers were deployed to provide consistent coverage across the swimming pool and surrounding outdoor spaces. To elevate the visual and experiential impact, the iconic Brionvega Radiofonografo was positioned beside the television as a design highlight—serving both as a functional audio piece and a statement of Italian design heritage."
      ],
      "keyProducts": [
        "K-array Vyper-KV102 x 2",
        "K-array Vyper-KV52 x 2",
        "K-array Rumble-KU210 x 2",
        "K-array Pinnacle-KR402 x 2",
        "K-array Kommander-KA28 x 1",
        "Nano M16 Mixer",
        "Brionvega Radiofonografo-RR126 x 1"
      ],
      "gallery": [
        "Robb Report x AHAM Capital_event_11image.jpg",
        "Robb Report x AHAM Capital_event_12image.jpg",
        "Robb Report x AHAM Capital_event_9image.jpg",
        "Robb Report x AHAM Capital_event_1image.jpg",
        "Robb Report x AHAM Capital_event_2image.jpg",
        "Robb Report x AHAM Capital_event_3image.jpg",
        "Robb Report x AHAM Capital_event_4image.jpg",
        "Robb Report x AHAM Capital_event_5image.jpg",
        "Robb Report x AHAM Capital_event_6image.jpg",
        "Robb Report x AHAM Capital_event_7image.jpg",
        "Robb Report x AHAM Capital_event_8image.jpg",
        "Robb Report x AHAM Capital_event_10image.jpg"
      ],
      "heroMedia": {
        "kind": "image",
        "src": "Robb Report x AHAM Capital_event_13image.jpg",
        "alt": "Seaside salon at Anantara Desaru"
      }
    },
    "brionvega-iconic-collection": {
      "slug": "brionvega-iconic-collection",
      "category": "Update",
      "title": "Brionvega, Iconic Italian Design Sound Technology",
      "location": "Asia Pacific Roadshow",
      "dateRange": "2024 Series",
      "overview": "Brionvega is an Italian manufacturer of iconic audio objects established in 1960, collaborating with celebrated architects and designers to produce timeless pieces.",
      "profile": [
        "Brionvega is an Italian manufacturer of iconic objects, established in 1960. As an icon of Italian design, Brionvega collaborates with notable architects and industrial designers. Brionvega’s mission is to revamp made in Italy design icons worldwide through the objects that made the history of Italian industrial design."
      ],
      "additionalNotes": [
        "Over 60 years of life in Italian design, Brionvega Art Products have celebrated milestones in industrial design history, showcased in the world’s most important modern art museums like MoMA in New York, the Victoria & Albert Museum in London, and many more."
      ],
      "eventNarrative": [
        "The Radiofonografo is an iconic object recognized globally for its uniqueness, exclusivity, and craftsmanship. Its timeless beauty has garnered immense appreciation as an art product. Now, revitalized with modern technology, this system creates a listening experience both stimulating and intriguing.",
        "The iconic pop radio expresses the desire for rebellion, novelty, and vibrant colors of the 1960s generation. Designed to integrate into the domestic environment, it is displayed proudly and becomes the room’s centerpiece. It is a timeless object that can keep its function and capacity to decorate the house for another 50 years.",
        "Totem celebrated the primary and elementary forms that compose and regulate our physical world in 1971. A simple white cubic volume that opens and modularly recomposes into a sophisticated Hi-Fi listening machine, with the two speakers that open to reveal the stereo module, the radio, and the record player."
      ],
      "gallery": [
        "Brionvega, Iconic Italian Design Sound Technologyevent7_image6.png",
        "Brionvega, Iconic Italian Design Sound Technologyevent7_image5.png",
        "Brionvega, Iconic Italian Design Sound Technology event_event7_image2.png",
        "Brionvega, Iconic Italian Design Sound Technologyevent7_image3.jpg",
        "Brionvega, Iconic Italian Design Sound Technology_event7_image4.jpg",
        "Brionvega, Iconic Italian Design Sound Technologyevent7_image1.jpg"
      ],
      "heroMedia": {
        "kind": "image",
        "src": "Brionvega, Iconic Italian Design Sound Technologyevent7_image1.jpg",
        "alt": "Brionvega iconic audio collection"
      }
    }
  }
}