{
  "trinnovProducts": [
    {
      "slug": "altitude-32",
      "name": "Altitude32",
      "headline": "Flagship Reference Immersive Processor",
      "description": "Software-based reference processor designed for large, no-compromise home cinemas and studio-grade listening rooms, with very high channel counts and full object-based decoding.",
      "story": "Altitude32 is the original Altitude platform processor that set the reference for immersive home cinema. Built around a powerful, software-defined architecture, it supports very high channel counts for expansive Dolby Atmos, DTS:X Pro, and Auro-3D layouts while running the same Trinnov Optimizer core used in top studios and premium cinemas. Because major functions live in software and a modular hardware design, the platform can be updated over time – including HDMI board upgrades and new rendering features – so a properly installed Altitude32 can evolve with future formats rather than being replaced.",
      "series": "Altitude",
      "finish": "Reference Immersive Processor",
      "collaboration": "Immersive Cinema",
      "image": "trinnov_audio_altitude_32_web_1-1.jpg",
      "features": [
        "Trinnov Optimizer with 3D microphone-based loudspeaker and room correction",
        "Object-based immersive decoding for Dolby Atmos, DTS-X Pro, and Auro-3D",
        "High-resolution audio processing up to 24-bit / 96 kHz with 64-bit floating-point engine",
        "Flexible bass management and support for complex multichannel speaker layouts"
      ],
      "applications": [
        "Reference home cinemas and screening rooms",
        "Luxury media rooms with complex multichannel layouts",
        "Private studios requiring precise room correction"
      ],
      "specs": [
        "Flagship Altitude platform processor for large home cinemas and reference rooms",
        "Supports very high immersive channel counts with extensive speaker layout flexibility",
        "Software-based platform with field-upgradable features, including modular HDMI video board",
        "Designed for long-term projects where future format support and updates are critical"
      ],
      "lifestyle": [
        {
          "src": "trinnov_audio_altitude_32_web_2-1.jpg",
          "alt": "Altitude32 front panel close-up with status display",
          "caption": "Altitude32 front panel, showing the minimalist industrial design and status display used in Trinnov cinema and studio installs."
        },
        {
          "src": "trinnov_audio_altitude_32_web_3-1.jpg",
          "alt": "Altitude32 installed in a home cinema equipment rack",
          "caption": "Altitude32 mounted in a dedicated equipment rack, feeding a large immersive home theater with complex loudspeaker layout."
        },
        {
          "src": "trinnov_altitude16_product_back.1500x731.jpg",
          "alt": "Altitude platform rear connectivity with balanced XLR and digital I/O",
          "caption": "Rear I/O of the Altitude platform, featuring balanced XLR outputs and digital connectivity for high-channel-count systems."
        }
      ]
    },
    {
      "slug": "altitude-16",
      "name": "Altitude16",
      "headline": "20-Channel Reference Immersive Processor",
      "description": "Brings Altitude-level processing and Trinnov Optimizer to premium residential theaters that need up to 20 discrete channels, in a more compact chassis.",
      "story": "Altitude16 delivers the same processing engine and sound quality as the Altitude32, but in a form factor and I/O configuration tailored to systems that will not exceed 20 channels. It renders up to 20 discrete channels of immersive audio with Dolby Atmos, DTS:X Pro, and Auro-3D, and natively processes high-resolution 24-bit / 96 kHz audio. The unit offers 16 balanced XLR outputs plus additional S/PDIF outputs, supports advanced bass management and active crossovers, and integrates the full Trinnov Optimizer calibration workflow. With HDMI 2.1 connectivity, eARC support, and a software-based platform that benefits from ongoing updates, Altitude16 is designed as a long-term reference for serious home cinemas that don’t require the extreme channel counts of Altitude32.",
      "series": "Altitude",
      "finish": "20-Channel Immersive Processor",
      "collaboration": "Residential Cinema",
      "image": "trinnov_altitude16_product_front-1.1500x731.jpg",
      "features": [
        "Trinnov Optimizer with 3D microphone-based loudspeaker and room correction",
        "Object-based immersive decoding for Dolby Atmos, DTS-X Pro, and Auro-3D",
        "High-resolution audio processing up to 24-bit / 96 kHz with 64-bit floating-point engine",
        "Flexible bass management and support for complex multichannel speaker layouts"
      ],
      "applications": [
        "Premium home cinemas and private theaters",
        "High-end media rooms with immersive audio layouts",
        "Screening rooms needing precise calibration"
      ],
      "specs": [
        "Immersive AV processor for home cinemas up to 20 discrete rendering channels",
        "Analog outputs - 16 × balanced XLR, with additional +4 channels available by combining analog and S/PDIF outputs",
        "Digital I/O - 4 × S/PDIF inputs (2 optical, 2 coaxial) and 2 × S/PDIF outputs (1 optical, 1 coaxial)",
        "HDMI 2.1 video board with 8 inputs, 2 outputs, HDR10 / HDR10+ / HLG / Dolby Vision, 4K120 / 8K60 and eARC on HDMI Output 1",
        "64-bit floating-point processing with native sample rates up to 96 kHz and Intel multi-core CPU platform"
      ],
      "lifestyle": [
        {
          "src": "trinnov_altitude16_cover_off.1500x731.png",
          "alt": "Altitude16 internal layout with cover removed",
          "caption": "Altitude16 with the top cover removed, revealing the modular, PC-based architecture that underpins the Altitude platform."
        },
        {
          "src": "trinnov_altitude16_product_back.1500x731.jpg",
          "alt": "Altitude16 rear panel with XLR, HDMI and digital audio connections",
          "caption": "Rear panel of the Altitude16, showing 16 balanced XLR outputs, S/PDIF I/O, and dual-output HDMI 2.1 connectivity for modern sources."
        },
        {
          "src": "trinnov_audio_altitude_32_web_1-1.jpg",
          "alt": "Altitude processor family front view in a studio-style environment",
          "caption": "Front view of an Altitude processor in a reference listening space, illustrating the shared industrial design across the Altitude family."
        }
      ]
    }
  ]
}